# -*- coding: utf-8 -*-
"""
Задание 6.2a

Сделать копию скрипта задания 6.2.

Добавить проверку введенного IP-адреса.
Адрес считается корректно заданным, если он:
   - состоит из 4 чисел (а не букв или других символов)
   - числа разделенны точкой
   - каждое число в диапазоне от 0 до 255

Если адрес задан неправильно, выводить сообщение: 'Неправильный IP-адрес'

Сообщение "Неправильный IP-адрес" должно выводиться только один раз,
даже если несколько пунктов выше не выполнены.

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

ip=input("Введите IP-адрес (например, 10.1.1.1): ")

ip_list=ip.split(".")

if len(ip_list)==4:
    for octet in ip_list:
        if octet.isdigit() and int(octet)<256:
            continue
        else:
            print("Неправильный IP-адрес")
            break
    else:
        first_octet=int(ip[:ip.find(".")])
        if 1<=first_octet<=223:
            print("unicast")
        elif 224<=first_octet<=239:
            print("multicast")
        elif ip=="255.255.255.255":
            print("local broadcast")
        elif ip=="0.0.0.0":
            print("unassigned")
        else:
            print("unused")
else:
    print("Неправильный IP-адрес")


